In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('output2.xlsx')
df.head()

            Name                               Address          Number
0   Marlon Bates  1235 E 22nd St\nLos Angeles CA 90011  (310) 429-6952
1  Deborah Bates  1235 E 22nd St\nLos Angeles CA 90011  (213) 748-6167
2            NaN                                   NaN             NaN
3  Edward Turner  1235 E 22nd St\nLos Angeles CA 90011  (323) 895-6738
4            NaN                                   NaN             NaN

In [3]:
df.isnull().sum()

Name       176
Address    178
Number     297
dtype: int64

In [4]:
df.dropna(subset=['Number'], inplace=True)
df.isnull().sum()

Name       0
Address    2
Number     0
dtype: int64

In [5]:
df.duplicated().sum()

16

In [6]:
df.drop_duplicates(keep='first', inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 673 entries, 0 to 985
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     673 non-null    object
 1   Address  671 non-null    object
 2   Number   673 non-null    object
dtypes: object(3)
memory usage: 21.0+ KB

In [8]:
df.to_excel('output2.xlsx', index=False)